type InfoRow = {
    number: string;
    text: string
}

type DetailsEnumType = {
    [key: string]: {
        name: string;
        info: InfoRow[];
    }
}

const detailsEnumType: DetailsEnumType = {
    'FPV8': {
        name: "Склад БпАК «ПАУЕР ЕЙТ PET-8»:",
        info: [
            {
                number: "1.",
                text: "FPV Квадрокоптер"
            },
            {
                number: "1.1.",
                text: "Карбонова рама"
            },
            {
                number: "1.2.",
                text: "4 мотори (розмір моторів 28.07, 28.08, 28.09 на вибір) максимальної потужності 1 кВт"
            },
            {
                number: "1.3.",
                text: "Універсальний регулятор оборотів (65 ампер на кожен мотор)"
            },
            {
                number: "1.4.",
                text: "Польотний контролер серії F405 або F722"
            },
            {
                number: "1.5.",
                text: "Камера високої світлочутливості роздільної здатності не менше 1200 ТВЛ"
            },
            {
                number: "1.6.",
                text: "Відеопередавач (5,8 GHz, 2W 40 channel)"
            },
            {
                number: "1.7.",
                text: "Антена (з коефіціентом не менше 2.5 дБі)"
            },
            {
                number: "1.8.",
                text: "Модуль Crossfire (потужністю не менше 500 мВт)"
            },
            {
                number: "1.9.",
                text: "Антена 915"
            },
            {
                number: "1.10.",
                text: "Акамулятор з’ємний"
            },
            {
                number: "1.11.",
                text: "Стрічка кріплення акамулятора"
            },
            {
                number: "2.",
                text: "Окуляри Skyzone (в комплекті з кабелями та захисним чохлом)"
            },
            {
                number: "3.",
                text: "Пульт керування Radiomaster tx16s в чорній захистній коробці"
            },
            {
                number: "4.",
                text: "Модуль керування crossfire 2W"
            },
            {
                number: "5.",
                text: "Інвертер живлення 220 - 12 вольт"
            },
            {
                number: "6.",
                text: "Зарядно-балансувальний модуль ISDT"
            },
            {
                number: "7.",
                text: "Виносний блок управління (в комплекті зі штативом чорного кольору висотою 2,6 м та кабелем довжиною 30 м з роз'ємами)"
            },
            {
                number: "8.",
                text: "Антена керування yagi 12 dBi 850-950 MHz"
            },
            {
                number: "9.",
                text: "Відеоприймач з антенами 17 dBi і 17 dBi захистного зеленого кольору."
            }
        ]
    },
    'FPV10': {
        name: "Склад БпАК «ПАУЕР ЕЙТ PET-10»:",
        info: [
            {
                number: "1.1.",
                text: "Карбонова рама"
            },
            {
                number: "1.2.",
                text: "4 мотори (розмір моторів 3110 або 3115 на вибір) максимальної потужності 2 кВт"
            },
            {
                number: "1.3.",
                text: "Універсальний регулятор оборотів (65 ампер на кожен мотор)"
            },
            {
                number: "1.4.",
                text: "Польотний контролер серії F405 або F722"
            },
            {
                number: "1.5.",
                text: "Камера високої світлочутливості роздільної здатності не менше 1200 ТВЛ"
            },
            {
                number: "1.6.",
                text: "Відеопередавач (5,8 GHz, 2W 40 channel)"
            },
            {
                number: "1.7.",
                text: "Антена (з коефіціентом не менше 2.5 дБі)"
            },
            {
                number: "1.8.",
                text: "Модуль Crossfire (потужністю не менше 500 мВт)"
            },
            {
                number: "1.9.",
                text: "Антена 915"
            },
            {
                number: "1.10.",
                text: "Акамулятор"
            },
            {
                number: "1.11.",
                text: "Стрічка кріплення акамулятора"

            },
            {
                number: "2.",
                text: "Окуляри Skyzone (в комплекті з кабелями та захисним чохлом)"
            },
            {
                number: "3.",
                text: "Пульт керування Radiomaster tx16s в чорній захистній коробці"
            },
            {
                number: "4.",
                text: "Модуль керування Crossfire 1W"
            },
            {
                number: "5.",
                text: "Інвертер живлення 220 - 12 вольт"
            },
            {
                number: "6.",
                text: "Зарядно-балансувальний модуль ISDT"
            },
            {
                number: "7.",
                text: "Виносний блок управління (в комплекті зі штативом захистного зеленого кольору висотою 2,6 м та кабелем довжиною 30 м з роз'ємами)"
            },
            {
                number: "8.",
                text: "Антена керування yagi 12 dBi 850-950 MHz"
            },
            {
                number: "9.",
                text: "Відеоприймач з антенами 17 dBi і 17 dBi захистного зеленого кольору."
            }
        ]
    }
};

export default detailsEnumType;
