type InfoEnumType = {
  [key: string]: {
      leftText: string;
      rightText: string;
  }
}

const infoEnum: InfoEnumType = {
  'FPV8': {
    'leftText':
      "Це безпілотний літальний апарат з радіоуправлінням, керуючи яким пілот отримує відеозображення з борту коптера безпосередньо на свої VR-окуляри, що допомагає йому максимально чітко та якісно виконувати складні маневри та досягати поставлених цілей. Використання VR-окулярів дозволяє оператору відчувати простір довкола дрона «від першої особи», так ніби він знаходиться безпосередньо на його борту, що значно полегшує процес управління БпАК. БпАК «FPV квадрокоптер ПАУЕР ЕЙТ» призначений як для аеророзвідки, так і для ведення бойових дій. Він може переносити на собі корисне навантаження вагою до 1,2 кг, зокрема боєприпаси чи гуманітарні вантажі, відповідно до цілей завдання, що виконується.",
    'rightText':
      "Практичний радіус дії БпАК складає 8-10 км в залежності від особливостей місцевості та погодних умов, що впливає на його радіогоризонт. До складу БпАК входить FPV квадрокоптер, VR-окуляри, зарядний пристрій, пульт управління та комплекс виносних антен в захисних кейсах. Квадрокоптер може бути оснащено відеозв’язком на частотах 1,3 або 5,8 ГГц та системою керування на частотах 915 або 750 МГц. Час розгортання комплексу – 2 хвилини. БпАК «FPV квадрокоптер ПАУЕР ЕЙТ» дозволяє пілоту безпечно виконувати бойові задачі зі знищення живої сили та легкої броньованої техніки ворога, а також ефективно досягати інших цілей, зокрема з аеророзвідки, коригування вогню або в ході виконання інших завдань.",
  },
  'FPV10': {
    'leftText':
      "Безпілотний авіаційний комплекс «FPV квадрокоптер ПАУЕР ЕЙТ PET-10» (далі БпАК «ПАУЕР ЕЙТ PET-10») це покращена, більш потужна версія квадрокоптеру PET-8, яка має покращені характеристики. Як і PET-8, PET-10 призначений для віддаленого керування, під час якого пілот бачить відеозображення з камери встановленої на квадрокоптері з проекцією на відеоокуляри. Пілот керує квадракоптером за допомогою радіоуправління, яке зв’язане з квадрокоптером. Оператор може вирішувати куди направляти крвадрокоптер і як виконувати різні маневри. Оператор користується відеоокулярами для перегляду зображення з квадрокоптера та його контролю в першій особі. Це дозволяє відчути, що оператор знаходиться в самому літальному апараті.",
    'rightText':
      "БпАК «ПАУЕР ЕЙТ PET-10» призначений для перевезення корисного навантаження, маса якого становить більш ніж 3000 грам. Корисним навантаженням можуть бути різні типи боєприпасів на вибір користувача. Практичний радіус дії становить до 17 км в залежності від ваги корисного навантаження, місцевості і прямого радіогоризонту, а також від погодних умов. До складу комплексу входить: пульт управління, VR-окуляри. зарядний пристрій, комплект виносних антен. Квадрокоптер може оснащуватися відео зв’язком на різних частотах 1.3 або 5.8 ГГц. А також керуванням 915 або 750 МГц. Комплект керування і антени поставляються в захисному кейсі. Час розгортання комплексу – 2 хв. БпАК «ПАУЕР ЕЙТ PET-10» дозволяє пілотам виконувати поставлені бойові задачі зі знищення піхоти та легкої броньованої техніки противника, а також використовувати БпАК «ПАУЕР ЕЙТ PET-10» для інших цілей в залежності від поставлених задач.",
  }
};

export default infoEnum;